GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_sdspi.c
    crc16 ^= rx_data;

    return crc16;
}

#endif

#if 1

static inline __attribute__((optimize("O3"))) void stm32l0_sdspi_transmit_crc16(stm32l0_sdspi_t *sdspi, const uint8_t *data, uint32_t count)
{
    stm32l0_spi_t *spi = sdspi->spi;
    SPI_TypeDef *SPI = spi->SPI;
    const uint8_t *data_e;
    uint16_t tx_data;

    data_e = data + count;

    SPI->CR1 &= ~SPI_CR1_SPE;
    SPI->CR1 |= (SPI_CR1_DFF | SPI_CR1_CRCEN);
    SPI->CR1 |= SPI_CR1_SPE;

    do
    {
	tx_data = *data++ << 8;
	tx_data |= *data++;

	__asm__ volatile("": : : "memory");
	
	while (!(SPI->SR & SPI_SR_TXE))
	{
	}

	SPI->DR = tx_data;

	__asm__ volatile("": : : "memory");
    } 
    while (data != data_e);

    while (!(SPI->SR & SPI_SR_TXE))
    {
    }

    while (SPI->SR & SPI_SR_BSY)
    {
    }

    SPI->CR1 &= ~SPI_CR1_SPE;
    SPI->CR1 &= ~SPI_CR1_CRCEN;
    SPI->CR1 |= SPI_CR1_SPE;

    tx_data = SPI->TXCRCR;

    SPI->DR = tx_data;

    while (!(SPI->SR & SPI_SR_TXE))
    {
    }

    while (SPI->SR & SPI_SR_BSY)
    {
    }

    SPI->CR1 &= ~SPI_CR1_SPE;
    SPI->CR1 &= ~SPI_CR1_DFF;
    SPI->CR1 |= SPI_CR1_SPE;

    /* Reset the overflow condition.
     */
    SPI->DR;
    SPI->SR;
}

#endif

static bool stm32l0_sdspi_detect(stm32l0_sdspi_t *sdspi)
{
    bool detect;

    /* This below is kind of fragile. The idea is to first set CS to 0, wait a tad
     * till the input settles to a 0. The switch the mode to input, while will make
     * the external pullup on CS take effect. If internal PULLDOWN does not work,
     * it overpowers the external pullupon CS. The delays are required to let
     * the signal on CS settle.
     */

    stm32l0_gpio_pin_write(sdspi->pin_cs, 0);
    armv6m_core_udelay(2);
    stm32l0_gpio_pin_input(sdspi->pin_cs);
    armv6m_core_udelay(2);
    detect = !!stm32l0_gpio_pin_read(sdspi->pin_cs);
    stm32l0_gpio_pin_output(sdspi->pin_cs);
    stm32l0_gpio_pin_write(sdspi->pin_cs, 1);

    return detect;
}

static void stm32l0_sdspi_select(stm32l0_sdspi_t *sdspi)
{
    stm32l0_spi_t *spi = sdspi->spi;

    SDSPI_STATISTICS_COUNT(sdcard_select);

    stm32l0_spi_acquire(spi, sdspi->clock, STM32L0_SPI_OPTION_MODE_0);

    /* CS output, drive CS to L */
    stm32l0_gpio_pin_write(sdspi->pin_cs, 0);

    /* The card will not drive DO for one more clock
     * after CS goes L, but will accept data right away.
     * The first thing after a select will be always
     * either a command (send_command), or a "Stop Token".
     * In both cases there will be a byte over the
     * bus, and hence DO will be stable.
     */
}

static void stm32l0_sdspi_unselect(stm32l0_sdspi_t *sdspi)
{
    stm32l0_spi_t *spi = sdspi->spi;

    SDSPI_STATISTICS_COUNT(sdcard_unselect);

    /* CS is output, drive CS to H */
    stm32l0_gpio_pin_write(sdspi->pin_cs, 1);

    /* The card drives the DO line at least one more
     * clock cycle after CS goes H. Hence send
     * one extra byte over the bus.
     */
    stm32l0_spi_data(spi, 0xff);

    stm32l0_spi_release(spi);
}

static void stm32l0_sdspi_mode(stm32l0_sdspi_t *sdspi, uint32_t mode)
{
    stm32l0_spi_t *spi = sdspi->spi;
    unsigned int n;

    stm32l0_spi_release(spi);

    if (mode == STM32L0_SDSPI_MODE_NONE)
    {
	sdspi->clock = 0;

	stm32l0_gpio_pin_configure(sdspi->pin_cs, (STM32L0_GPIO_PARK_PULLUP | STM32L0_GPIO_PUPD_PULLUP | STM32L0_GPIO_OSPEED_VERY_HIGH | STM32L0_GPIO_OTYPE_PUSHPULL | STM32L0_GPIO_MODE_INPUT));
    }
    else
    {
	if (mode == STM32L0_SDSPI_MODE_IDENTIFY)
	{
	    sdspi->clock = 400000;
	}
	else
	{
	    sdspi->clock = 25000000;
	}

	stm32l0_gpio_pin_configure(sdspi->pin_cs, (STM32L0_GPIO_PARK_PULLUP | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_VERY_HIGH | STM32L0_GPIO_OTYPE_PUSHPULL | STM32L0_GPIO_MODE_OUTPUT));
	stm32l0_gpio_pin_write(sdspi->pin_cs, 1);

	stm32l0_spi_acquire(spi, sdspi->clock, STM32L0_SPI_OPTION_MODE_0);

	if (mode == STM32L0_SDSPI_MODE_IDENTIFY)
	{
  	    stm32l0_gpio_pin_output(spi->pins.mosi);
	    stm32l0_gpio_pin_write(spi->pins.mosi, 1);

	    /* Here CS/MOSI are driven both to H.
	     *
	     * Specs says to issue 74 clock cycles in SPI mode while CS/MOSI are H,
	     * so simply send 10 bytes over the clock line.
	     */
    
	    for (n = 0; n < 10; n++)
	    {
		stm32l0_spi_data(sdspi->spi, 0xff);
	    }
    
  	    stm32l0_gpio_pin_alternate(spi->pins.mosi);
	}

	stm32l0_gpio_pin_write(sdspi->pin_cs, 0);
    }
}

/*
 * stm32l0_sdspi_wait_ready(stm32l0_sdspi_t *sdspi, uint32_t timeout)
 *
 * Wait till DO transitions from BUSY (0x00) to READY (0xff).
 */

static int stm32l0_sdspi_wait_ready(stm32l0_sdspi_t *sdspi, uint32_t timeout)
{
    stm32l0_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    uint32_t tstart, tend;
    uint8_t token;

    /* While waiting for non busy (not 0x00) the host can
     * release the CS line to let somebody else access the
     * bus. However there needs to be an extra clock
     * cycle after driving CS to H for the card to release DO,
     * as well as one extra clock cycle after driving CS to L
     * before the data is valid again.
     */

    tstart = armv6m_systick_millis();

    do
    {
	tend = armv6m_systick_millis();

        token = stm32l0_spi_data(spi, 0xff);

        if (token == SD_READY_TOKEN)
        {
            break;
        }

	if ((tend - tstart) > timeout)
	{
	    status = F_ERR_ONDRIVE;
	}
    }
    while (status == F_NO_ERROR);

    return status;
}

static int stm32l0_sdspi_command(stm32l0_sdspi_t *sdspi, uint8_t index, uint32_t argument, uint32_t wait)
{
    stm32l0_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    unsigned int n;
    uint8_t data[5], response, crc7;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_COMMAND_RETRIES +1;
#else /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */
    unsigned int retries = 0;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */

    SDSPI_STATISTICS_COUNT(sdcard_command);

    data[0] = 0x40 | index;
    data[1] = argument >> 24;
    data[2] = argument >> 16;
    data[3] = argument >> 8;
    data[4] = argument >> 0;

#if (DOSFS_CONFIG_SDCARD_CRC == 1)
    crc7 = (stm32l0_sdspi_compute_crc7(data, 5) << 1) | 0x01;
#else /* (DOSFS_CONFIG_SDCARD_CRC == 1) */
    if (index == SD_CMD_GO_IDLE_STATE)
    {
        crc7 = 0x95;
    }
    else if (index == SD_CMD_SEND_IF_COND)
    {
        crc7 = 0x87;
    }
    else
    {
        crc7 = 0x01;
    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) */

    do
    {
	/* A command needs at least one back to back idle cycle.
	 */
	
        stm32l0_spi_data(spi, 0xff);

