GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_sdspi.c
	stm32l0_spi_data(spi, data[0]);
	stm32l0_spi_data(spi, data[1]);
	stm32l0_spi_data(spi, data[2]);
	stm32l0_spi_data(spi, data[3]);
	stm32l0_spi_data(spi, data[4]);
	stm32l0_spi_data(spi, crc7);

	/* NCR is 1..8 bytes, so simply always discard the first byte,
	 * and then read up to 8 bytes or till a vaild response
	 * was seen. N.b that STOP_TRANSMISSION specifies that
	 * the first byte on DataOut after reception of the command
	 * is a stuffing byte that has to be ignored. The discard
	 * takes care of that here.
	 */

	stm32l0_spi_data(spi, 0xff);

	for (n = 0; n < 8; n++)
	{
	    response = stm32l0_spi_data(spi, 0xff);
        
	    if (!(response & 0x80))
	    {
		/*
		 * A STOP_TRANSMISSION can be issued before the card
		 * had send a "Data Error Token" for that last block
		 * that we are not really intrested in. This could result
		 * in a "Parameter Error" if the next block is out of bounds.
		 * Due to the way CMD_STOP_TRANSMISSION gets send there is
		 * also the chance it gets an "Illegal Command" error ...
		 */
		if (index == SD_CMD_STOP_TRANSMISSION)
		{
		    response &= ~(SD_R1_ILLEGAL_COMMAND | SD_R1_PARAMETER_ERROR);
		}
		break;
	    }
	}

	sdspi->response[0] = response;

	/* Always read the rest of the data to avoid synchronization
	 * issues. Worst case the data read is random.
	 */
	for (n = 1; n <= wait; n++)
	{
	    sdspi->response[n] = stm32l0_spi_data(spi, 0xff);
	} 

	if (response & 0x88)
	{
	    if (response & 0x80)
	    {
		SDSPI_STATISTICS_COUNT(sdcard_command_timeout);

#if (DOSFS_CONFIG_STATISTICS == 1)
		sdspi->statistics.sdcard_command_timeout_2[index]++;
#endif
	    }
	    else
	    {
		SDSPI_STATISTICS_COUNT(sdcard_command_crcfail);

#if (DOSFS_CONFIG_STATISTICS == 1)
		sdspi->statistics.sdcard_command_crcfail_2[index]++;
#endif
	    }

#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0)
	    if (retries > 1)
	    {
	        stm32l0_gpio_pin_write(sdspi->pin_cs, 1);
	        stm32l0_gpio_pin_write(sdspi->pin_cs, 0);

		SDSPI_STATISTICS_COUNT(sdcard_command_retry);
		    
		retries--;
	    }
	    else
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */
	    {
		status = F_ERR_ONDRIVE;

		retries = 0;
	    }
	}
	else
	{
	    if ((index != SD_CMD_STOP_TRANSMISSION) && (index != SD_CMD_SEND_STATUS))
	    {
		if (response & SD_R1_ERROR_MASK)
		{
		    status = F_ERR_ONDRIVE;
		}
	    }

	    retries = 0;
	}
    }
    while (retries != 0);

    if (status != F_NO_ERROR)
    {
	SDSPI_STATISTICS_COUNT(sdcard_command_fail);

#if (DOSFS_CONFIG_STATISTICS == 1)
	sdspi->statistics.sdcard_command_fail_2[index]++;
#endif
    }

    return status;
}

static int stm32l0_sdspi_receive(stm32l0_sdspi_t *sdspi, uint8_t *data, uint32_t count, uint32_t *p_count)
{
    stm32l0_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    uint8_t token;
    uint16_t crc16;
    uint32_t total, blksz, tstart, tend;

    SDSPI_STATISTICS_COUNT(sdcard_receive);

    total = count;
    blksz = (count >= 512) ? 512 : count;

    tstart = armv6m_systick_millis();

    do
    {
	/* If a "Start Block Token" (0xfe) zips by then
	 * a data block will follow. Otherwise a "Data Error Token"
	 * shows up:
	 *
	 * 0x01 Execution Error
	 * 0x02 CC Error
	 * 0x04 Card ECC failed
	 * 0x08 Out of Range
	 *
	 * The maximum documented timeout is 100ms for SDHC.
	 */

	tend = armv6m_systick_millis();

	token = stm32l0_spi_data(spi, 0xff);

	if (token == SD_START_READ_TOKEN)
	{
	    crc16 = stm32l0_sdspi_receive_crc16(sdspi, data, blksz);
	    
#if (DOSFS_CONFIG_SDCARD_CRC == 1)
	    if (crc16 != 0)
	    {
	        SDSPI_STATISTICS_COUNT(sdcard_receive_crcfail);

		/* On a CRC error always send a STOP_TRANSMISSION, just to make sure.
		 */
		status = stm32l0_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 0);
		
		if (status == F_NO_ERROR)
		{
		    sdspi->state = STM32L0_SDSPI_STATE_READY;
		}

		break;
	    }
	    else
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1)  */
	    {
		data  += blksz;
		total -= blksz;

		tstart = armv6m_systick_millis();
	    }
	}

	else if ((token & SD_DATA_ERROR_TOKEN_VALID_MASK) == SD_DATA_ERROR_TOKEN_VALID_DATA)
	{
	    sdspi->state = STM32L0_SDSPI_STATE_READY;

	    if (token & SD_DATA_ERROR_CARD_ECC_FAILED)
	    {
		status = F_ERR_INVALIDSECTOR;
	    }
	    else
	    {
		status = F_ERR_ONDRIVE;
	    }
	}

	else
	{
	    if ((tend - tstart) > SD_READ_TIMEOUT)
	    {
	        SDSPI_STATISTICS_COUNT(sdcard_receive_timeout);
		
		status = F_ERR_ONDRIVE;
	    }
	}
    }
    while ((status == F_NO_ERROR) && total);
	
    *p_count = (count - total);

    if (status != F_NO_ERROR)
    {
	SDSPI_STATISTICS_COUNT(sdcard_receive_fail);
    }

    return status;
}

static int stm32l0_sdspi_transmit(stm32l0_sdspi_t *sdspi, uint8_t start, const uint8_t *data, uint32_t count, bool *p_check)
{
    stm32l0_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    uint8_t token, response;
    uint32_t total, blksz, tstart, tend;

    SDSPI_STATISTICS_COUNT(sdcard_transmit);

    *p_check = false;

    total = count;
    blksz = (count >= 512) ? 512 : count;

    tstart = armv6m_systick_millis();

    do
    {
	tend = armv6m_systick_millis();

        token = stm32l0_spi_data(spi, 0xff);

        if (token == SD_READY_TOKEN)
        {
	    stm32l0_spi_data(spi, start);
	    stm32l0_sdspi_transmit_crc16(sdspi, data, blksz);

	    /* At last read back the "Data Response Token":
	     *
	     * 0x05 No Error
	     * 0x0b CRC Error
	     * 0x0d Write Error
	     */
	    
	    response = stm32l0_spi_data(spi, 0xff) & SD_DATA_RESPONSE_MASK;

	    if (response != SD_DATA_RESPONSE_ACCEPTED)
	    {
		*p_check = true;

		status = stm32l0_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 1);

		if (status != F_NO_ERROR)
		{
		    status = stm32l0_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 1);
		}

		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_wait_ready(sdspi, SD_WRITE_STOP_TIMEOUT);
		    
		    if (status == F_NO_ERROR)
		    {
			sdspi->state = STM32L0_SDSPI_STATE_READY;

			if (response == SD_DATA_RESPONSE_CRC_ERROR)
			{
			    SDSPI_STATISTICS_COUNT(sdcard_transmit_crcfail);
			}
			else
			{
			    status = stm32l0_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
			    
			    if (status == F_NO_ERROR)
			    {
				if ((sdspi->response[0] & SD_R1_ERROR_MASK) || (sdspi->response[1] & SD_R2_ERROR_MASK))
				{
				    if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
				    {
					status = F_ERR_WRITEPROTECT;
				    }
				    else if (sdspi->response[1] & SD_R2_CARD_ECC_FAILED)
				    {
					status = F_ERR_INVALIDSECTOR;
				    }
				    else
				    {
					status = F_ERR_ONDRIVE;
				    }
				}
			    }
			}
		    }
		}

		break;
	    }
	    else
	    {
		data  += blksz;
		total -= blksz;

		tstart = armv6m_systick_millis();
	    }
	}
	else
	{
	    if ((tend - tstart) > SD_WRITE_TIMEOUT)
	    {
	        SDSPI_STATISTICS_COUNT(sdcard_transmit_timeout);

		status = F_ERR_ONDRIVE;
	    }
	}
    }
    while ((status == F_NO_ERROR) && total);

    if (status != F_NO_ERROR)
    {
	SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);
    }

