GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_sdspi.c
    return status;
}

static int stm32l0_sdspi_read_stop(stm32l0_sdspi_t *sdspi)
{
    int status = F_NO_ERROR;

    SDSPI_STATISTICS_COUNT(sdcard_read_stop);

    status = stm32l0_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 0);

    if (status == F_NO_ERROR)
    {
	sdspi->state = STM32L0_SDSPI_STATE_READY;

	if (sdspi->response[0] & SD_R1_ERROR_MASK)
	{
	    status = stm32l0_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
				
	    if (status == F_NO_ERROR)
	    {
		if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
		{
		    status = F_ERR_WRITEPROTECT;
		}
		else if (sdspi->response[1] & SD_R2_CARD_ECC_FAILED)
		{
		    status = F_ERR_INVALIDSECTOR;
		}
		else
		{
		    status = F_ERR_ONDRIVE;
		}
	    }
	}
    }
				
    return status;
}

static int stm32l0_sdspi_write_stop(stm32l0_sdspi_t *sdspi)
{
    stm32l0_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;

    SDSPI_STATISTICS_COUNT(sdcard_write_stop);

    /* There need to be 8 clocks before the "Stop Transfer Token",
     * and 8 clocks after it, before the card signals busy properly.
     * The 8 clocks before are covered by stm32l0_sdspi_wait_ready().
     */

    status = stm32l0_sdspi_wait_ready(sdspi, SD_WRITE_TIMEOUT);
    
    if (status == F_NO_ERROR)
    {
	stm32l0_spi_data(spi, SD_STOP_TRANSMISSION_TOKEN);
	stm32l0_spi_data(spi, 0xff);

	sdspi->state = STM32L0_SDSPI_STATE_WRITE_STOP;
    }

    return status;
}

static int stm32l0_sdspi_write_sync(stm32l0_sdspi_t *sdspi)
{
    int status = F_NO_ERROR;

    SDSPI_STATISTICS_COUNT(sdcard_write_sync);

    status = stm32l0_sdspi_wait_ready(sdspi, SD_WRITE_STOP_TIMEOUT);

    if (status == F_NO_ERROR)
    {
	sdspi->state = STM32L0_SDSPI_STATE_READY;

	status = stm32l0_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
	
	if (status == F_NO_ERROR)
	{
	    if ((sdspi->response[0] & SD_R1_ERROR_MASK) || (sdspi->response[1] & SD_R2_ERROR_MASK))
	    {
		if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP | SD_R2_CARD_ECC_FAILED))
		{
		    if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
		    {
			status = F_ERR_WRITEPROTECT;
		    }
		    else
		    {
			status = F_ERR_INVALIDSECTOR;
		    }
		}
		else
		{
		    status = F_ERR_ONDRIVE;
		}
	    }
	}
    }

    if (status != F_NO_ERROR)
    {
	SDSPI_STATISTICS_COUNT(sdcard_write_sync_fail);
    }

    return status;
}

static int stm32l0_sdspi_idle(stm32l0_sdspi_t *sdspi, uint32_t *p_media)
{
    stm32l0_spi_t *spi = sdspi->spi;
    int status = F_NO_ERROR;
    uint32_t media;
    unsigned int n;

    SDSPI_STATISTICS_COUNT(sdcard_idle);

    media = DOSFS_MEDIA_NONE;
    
    stm32l0_sdspi_mode(sdspi, STM32L0_SDSPI_MODE_IDENTIFY);

    /* Apply an initial CMD_GO_IDLE_STATE, so that the card is out of
     * data read/write mode, and can properly respond.
     */

    stm32l0_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);

    if (sdspi->response[0] != 0x01)
    {
	/* There could be 2 error scenarios. One is that the
	 * CMD_GO_IDLE_STATE was send while the card was waiting
	 * for the next "Start Block" / "Stop Transmission" token.
	 * The card will answer that normally by signaling BUSY,
	 * when means there would be a 0x00 response.
	 * The other case is that there was a reset request while
	 * being in the middle of a write transaction. As a result
	 * the card will send back a stream of non-zero values
	 * (READY or a "Data Response Token"), which can be handled
	 * by simple flushing the transaction (CRC will take care of
	 * rejecting the data ... without CRC the last write will be
	 * garbage.
	 *
	 * Hence first drain a possible write command, and then
	 * rety CMD_GO_IDLE_STATE after a dosfs_sdcard_wait_ready().
	 * If the card is still in BUSY mode, then retry the
	 * CMD_GO_IDLE_STATE again.
	 */

	if (sdspi->response[0] != 0x00)
	{
	    for (n = 0; n < 1024; n++)
	    {
		stm32l0_spi_data(spi, 0xff);
	    }

	    stm32l0_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);
	}

	stm32l0_sdspi_wait_ready(sdspi, SD_WRITE_STOP_TIMEOUT);
	    
	stm32l0_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);

	if (sdspi->response[0] == 0x00)
	{
	    stm32l0_sdspi_wait_ready(sdspi, SD_WRITE_STOP_TIMEOUT);
	    
	    stm32l0_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);
	}
    }

    if (sdspi->response[0] == 0x01)
    {
	stm32l0_sdspi_command(sdspi, SD_CMD_SEND_IF_COND, 0x000001aa, 4);

	if (sdspi->response[0] == 0x01)
	{
	    if ((sdspi->response[1] == 0x00) &&
		(sdspi->response[2] == 0x00) &&
		(sdspi->response[3] == 0x01) &&
		(sdspi->response[4] == 0xaa))
	    {
		media = DOSFS_MEDIA_SDHC;
	    }
	    else
	    {
		status = F_ERR_INVALIDMEDIA;
	    }
	}
	else
	{
	    media = DOSFS_MEDIA_SDSC;
	}
    }

    if (status == F_NO_ERROR)
    {
	status = stm32l0_sdspi_command(sdspi, SD_CMD_READ_OCR, 0x00000000, 4);

	if (status == F_NO_ERROR)
	{
	    sdspi->OCR = ((sdspi->response[1] << 24) |
			  (sdspi->response[2] << 16) |
			  (sdspi->response[3] <<  8) |
			  (sdspi->response[4] <<  0));
	    
	    if (!(sdspi->OCR & 0x00300000))
	    {
		status = F_ERR_INVALIDMEDIA;
	    }
	}
    }

    if ((p_media == NULL) || (status != F_NO_ERROR))
    {
	stm32l0_sdspi_mode(sdspi, STM32L0_SDSPI_MODE_NONE);
    }
    
    if (p_media)
    {
	*p_media = media;
    }

    return status;
}

static uint32_t stm32l0_sdspi_au_size_table[16] = {
    0,
    32,      /* 16KB  */
    64,      /* 32KB  */
    128,     /* 64KB  */
    256,     /* 128KB */
    512,     /* 256KB */
    1024,    /* 512KB */
    2048,    /* 1MB   */
    4096,    /* 2MB   */
    8192,    /* 4MB   */
    16384,   /* 8MB   */
    24576,   /* 12MB  */
    32768,   /* 16MB  */
    49152,   /* 24MB  */
    65536,   /* 32MB  */
    131072,  /* 64MB  */
};

static int stm32l0_sdspi_reset(stm32l0_sdspi_t *sdspi, uint32_t media)
{
    int status = F_NO_ERROR;
    uint32_t millis, count;

    SDSPI_STATISTICS_COUNT(sdcard_reset);

    /* Send ACMD_SD_SEND_OP_COND, and wait till the initialization process is done. The SDCARD has
     * 1000ms to complete this initialization process.
     */

