GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_sdspi.c
    millis = armv6m_systick_millis();
    
    do
    {
	status = stm32l0_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
	    
	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_command(sdspi, SD_ACMD_SD_SEND_OP_COND, ((media == DOSFS_MEDIA_SDHC) ? 0x40300000 : 0x00300000), 0);
		
	    if (status == F_NO_ERROR)
	    {
		if (!(sdspi->response[0] & SD_R1_IN_IDLE_STATE))
		{
		    break;
		}
		    
		if (((uint32_t)armv6m_systick_millis() - millis) > 1000)
		{
		    status = F_ERR_ONDRIVE;
		}
	    }
	}
    }
    while (status == F_NO_ERROR);

    if (status == F_NO_ERROR)
    {
	if (media == DOSFS_MEDIA_SDHC)
	{
	    status = stm32l0_sdspi_command(sdspi, SD_CMD_READ_OCR, 0x00000000, 4);
	    
	    if (status == F_NO_ERROR)
	    {
		sdspi->OCR = ((sdspi->response[1] << 24) |
			      (sdspi->response[2] << 16) |
			      (sdspi->response[3] <<  8) |
			      (sdspi->response[4] <<  0));
		
		if (sdspi->OCR & 0x40000000)
		{
		    media = DOSFS_MEDIA_SDHC;
		}
		else
		{
		    media = DOSFS_MEDIA_SDSC;
		}
	    }
	}
    }

    /* If we got here without a hitch then it's time to enter transfer mode
     * and setup buswidth and speed.
     */

    if (status == F_NO_ERROR)
    {
	stm32l0_sdspi_mode(sdspi, STM32L0_SDSPI_MODE_DATA_TRANSFER);

#if (DOSFS_CONFIG_SDCARD_CRC == 1)
	if (status == F_NO_ERROR)
	{
	    status  = stm32l0_sdspi_command(sdspi, SD_CMD_CRC_ON_OFF, 1, 0);
	}
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) */

	status = stm32l0_sdspi_command(sdspi, SD_CMD_SEND_CID, 0, 0);
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_receive(sdspi, &sdspi->CID[0], 16, &count);
	    
	    if ((status == F_NO_ERROR) && (count != 16))
	    {
		status = F_ERR_READ;
	    }
	}
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_command(sdspi, SD_CMD_SEND_CSD, 0, 0);
	    
	    if (status == F_NO_ERROR)
	    {
		status = stm32l0_sdspi_receive(sdspi, &sdspi->CSD[0], 16, &count);
		
		if ((status == F_NO_ERROR) && (count != 16))
		{
		    status = F_ERR_READ;
		}
	    }
	}

	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
		
	    if (status == F_NO_ERROR)
	    {
		status = stm32l0_sdspi_command(sdspi, SD_ACMD_SEND_SCR, 0, 0);

		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_receive(sdspi, &sdspi->SCR[0], 8, &count);
		    
		    if ((status == F_NO_ERROR) && (count != 8))
		    {
			status = F_ERR_READ;
		    }
		}
	    }
	}
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
		
	    if (status == F_NO_ERROR)
	    {
		status = stm32l0_sdspi_command(sdspi, SD_ACMD_SD_STATUS, 0, 1);

		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_receive(sdspi, &sdspi->SSR[0], 64, &count);
		    
		    if ((status == F_NO_ERROR) && (count != 64))
		    {
			status = F_ERR_READ;
		    }
		}
	    }
	}
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_command(sdspi, SD_CMD_SET_BLOCKLEN, 512, 0);
	}
    }

    if (status == F_NO_ERROR)
    {
	sdspi->state = STM32L0_SDSPI_STATE_READY;

	sdspi->media = media;
	sdspi->shift = 9;
	sdspi->au_size = 0;
	sdspi->erase_size = 0;
	sdspi->erase_timeout = 0;
	sdspi->erase_offset = 0;

	if (media == DOSFS_MEDIA_SDHC)
	{
	    sdspi->shift = 0;
	    sdspi->au_size = stm32l0_sdspi_au_size_table[stm32l0_sdspi_slice(sdspi->SSR, 512, 428, 4)];
	    sdspi->erase_size = stm32l0_sdspi_slice(sdspi->SSR, 512, 408, 16);
	    sdspi->erase_timeout = stm32l0_sdspi_slice(sdspi->SSR, 512, 402, 6) * 1000;
	    sdspi->erase_offset = stm32l0_sdspi_slice(sdspi->SSR, 512, 400, 2) * 1000;

	    if (!sdspi->au_size || !sdspi->erase_size || !sdspi->erase_timeout)
	    {
		sdspi->erase_size = 0;
		sdspi->erase_timeout = 0;
		sdspi->erase_offset = 0;
	    }
	}

	SDSPI_STATISTICS_COUNT(sdcard_select);
    }
    else
    {
	sdspi->state = STM32L0_SDSPI_STATE_RESET;
	
	stm32l0_sdspi_mode(sdspi, STM32L0_SDSPI_MODE_NONE);

	status = F_ERR_CARDREMOVED;
    }
    
    return status;
}

static int stm32l0_sdspi_lock(stm32l0_sdspi_t *sdspi, int state, uint32_t address)
{
    int status = F_NO_ERROR;
    uint32_t media;

#if defined(DOSFS_PORT_SDCARD_LOCK)
    status = DOSFS_PORT_SDCARD_LOCK();
    
    if (status == F_NO_ERROR)
#endif /* DOSFS_PORT_SDCARD_LOCK */
    {
	stm32l0_system_lock(STM32L0_SYSTEM_LOCK_STOP);
	stm32l0_system_lock(STM32L0_SYSTEM_LOCK_CLOCKS);

	if (sdspi->state == STM32L0_SDSPI_STATE_INIT)
	{
	    if (stm32l0_sdspi_detect(sdspi))
	    {
		sdspi->state = STM32L0_SDSPI_STATE_RESET;
	    }
	    else
	    {
		status = F_ERR_CARDREMOVED;
	    }
	}
	
	if (status == F_NO_ERROR)
	{
	    if (sdspi->state == STM32L0_SDSPI_STATE_RESET)
	    {
		status = stm32l0_sdspi_idle(sdspi, &media);

		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_reset(sdspi, media);
		}
		else
		{
		    status = F_ERR_CARDREMOVED;
		}
	    }
	    else
	    {
		stm32l0_sdspi_select(sdspi);

		if (sdspi->state == STM32L0_SDSPI_STATE_READ_MULTIPLE)
		{
		    if ((state != STM32L0_SDSPI_STATE_READ_MULTIPLE) || (sdspi->address != address))
		    {
			status = stm32l0_sdspi_read_stop(sdspi);
		    }
		}

		if (sdspi->state == STM32L0_SDSPI_STATE_WRITE_MULTIPLE)
		{
		    if ((state != STM32L0_SDSPI_STATE_WRITE_MULTIPLE) || (sdspi->address != address))
		    {
			status = stm32l0_sdspi_write_stop(sdspi);
		    }
		}

		if (sdspi->state == STM32L0_SDSPI_STATE_WRITE_STOP)
		{
		    if (state != STM32L0_SDSPI_STATE_WRITE_STOP)
		    {
			status = stm32l0_sdspi_write_sync(sdspi);
		    }
		}
	    }
	}
    }
    
    if (status != F_NO_ERROR)
    {
	status = stm32l0_sdspi_unlock(sdspi, status);
    }

    return status;
}

static int stm32l0_sdspi_unlock(stm32l0_sdspi_t *sdspi, int status)
{
    if ((sdspi->state != STM32L0_SDSPI_STATE_INIT) && (sdspi->state != STM32L0_SDSPI_STATE_RESET))
    {
	stm32l0_sdspi_unselect(sdspi);
    }

    if (status == F_ERR_ONDRIVE)
    {
	if (stm32l0_sdspi_idle(sdspi, NULL) == F_NO_ERROR)
	{
	    sdspi->state = STM32L0_SDSPI_STATE_INIT;
	}
	else
	{
	    sdspi->state = STM32L0_SDSPI_STATE_RESET;

	    status = F_ERR_CARDREMOVED;
	}
    }

