GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_sdspi.c
    stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_CLOCKS);
    stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_STOP);

#if defined(DOSFS_PORT_SDCARD_UNLOCK)
    DOSFS_PORT_SDCARD_UNLOCK();
#endif /* DOSFS_PORT_SDCARD_UNLOCK */

    return status;
}

static int stm32l0_sdspi_release(void *context)
{
    stm32l0_sdspi_t *sdspi = (stm32l0_sdspi_t*)context;
    int status = F_NO_ERROR;

    if ((sdspi->state != STM32L0_SDSPI_STATE_INIT) && (sdspi->state != STM32L0_SDSPI_STATE_RESET))
    {
	status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_READY, 0);
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_unlock(sdspi, status);

	    stm32l0_sdspi_mode(sdspi, STM32L0_SDSPI_MODE_NONE);

	    stm32l0_spi_notify(sdspi->spi, NULL, NULL);

	    sdspi->state = STM32L0_SDSPI_STATE_INIT;
	}
    }

    return status;
}

static int stm32l0_sdspi_info(void *context, uint8_t *p_media, uint8_t *p_write_protected, uint32_t *p_block_count, uint32_t *p_au_size, uint32_t *p_serial)
{
    stm32l0_sdspi_t *sdspi = (stm32l0_sdspi_t*)context;
    int status = F_NO_ERROR;
    uint32_t c_size, c_size_mult, read_bl_len;

    status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_READY, 0);

    if (status == F_NO_ERROR)
    {
	*p_media = sdspi->media;
	*p_write_protected = false;

	/* PERM_WRITE_PROTECT.
	 * TMP_WRITE_PROTECT
	 */
	if (stm32l0_sdspi_slice(sdspi->CSD, 128, 12, 2))
	{
	    *p_write_protected = true;
	}
	
	if ((sdspi->CSD[0] & 0xc0) == 0)
	{
	    /* SDSC */
	    
	    read_bl_len = stm32l0_sdspi_slice(sdspi->CSD, 128, 80, 4);
	    c_size = stm32l0_sdspi_slice(sdspi->CSD, 128, 62, 12);
	    c_size_mult = stm32l0_sdspi_slice(sdspi->CSD, 128, 47, 3);
	    
	    *p_block_count = ((c_size + 1) << (c_size_mult + 2)) << (read_bl_len - 9);
	}
	else
	{
	    /* SDHC */

	    c_size = stm32l0_sdspi_slice(sdspi->CSD, 128, 48, 22);

	    *p_block_count = (c_size + 1) << (19 - 9);
	}

	*p_au_size = sdspi->au_size;

	*p_serial = stm32l0_sdspi_slice(sdspi->CID, 128, 24, 32);

	status = stm32l0_sdspi_unlock(sdspi, status);
    }

    return status;
}

static int stm32l0_sdspi_notify(void *context, dosfs_device_notify_callback_t callback, void *cookie)
{
    stm32l0_sdspi_t *sdspi = (stm32l0_sdspi_t*)context;
    int status = F_NO_ERROR;

    stm32l0_spi_notify(sdspi->spi, callback, cookie);

    return status;
}

static int stm32l0_sdspi_format(void *context)
{
    return F_NO_ERROR;
}

static int stm32l0_sdspi_erase(void *context, uint32_t address, uint32_t length)
{
    stm32l0_sdspi_t *sdspi = (stm32l0_sdspi_t*)context;
    int status = F_NO_ERROR;
    uint32_t au_start, au_end, timeout;

    if (sdspi->erase_size)
    {
	au_start = address / sdspi->au_size;
	au_end   = ((address + length + (sdspi->au_size -1)) / sdspi->au_size);

	timeout = ((sdspi->erase_timeout * (au_end - au_start)) / sdspi->erase_size) + sdspi->erase_offset;

	if (timeout < 1000)
	{
	    timeout = 1000;
	}

	if (address != (au_start * sdspi->au_size))
	{
	    timeout += 250;
	}

	if ((address + length) != (au_end * sdspi->au_size))
	{
	    timeout += 250;
	}
	
	status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_READY, 0);

	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_command(sdspi, SD_CMD_ERASE_WR_BLK_START_ADDR, (address << sdspi->shift), 0);
	
	    if (status == F_NO_ERROR)
	    {
		status = stm32l0_sdspi_command(sdspi, SD_CMD_ERASE_WR_BLK_END_ADDR, ((address + length -1) << sdspi->shift), 0);
	
		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_command(sdspi, SD_CMD_ERASE, 0, 0);

		    if (status == F_NO_ERROR)
		    {
			status = stm32l0_sdspi_wait_ready(sdspi, timeout);

			if (status == F_NO_ERROR)
			{
			    status = stm32l0_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
			
			    if (status == F_NO_ERROR)
			    {
				if ((sdspi->response[0] & SD_R1_ERROR_MASK) || (sdspi->response[1] & SD_R2_ERROR_MASK))
				{
				    if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
				    {
					status = F_ERR_WRITEPROTECT;
				    }
				    else if (sdspi->response[1] & SD_R2_CARD_ECC_FAILED)
				    {
					status = F_ERR_INVALIDSECTOR;
				    }
				    else
				    {
					status = F_ERR_ONDRIVE;
				    }
				}
				else
				{
				    SDSPI_STATISTICS_COUNT_N(sdcard_erase, length);
				}
			    }
			}
			else
			{
			    SDSPI_STATISTICS_COUNT(sdcard_erase_timeout);
			}
		    }
		}
	    }

	    status = stm32l0_sdspi_unlock(sdspi, status);
	}
    }

    return status;
}

static int stm32l0_sdspi_discard(void *context, uint32_t address, uint32_t length)
{
    return F_NO_ERROR;
}

static int stm32l0_sdspi_read(void *context, uint32_t address, uint8_t *data, uint32_t length, bool prefetch)
{
    stm32l0_sdspi_t *sdspi = (stm32l0_sdspi_t*)context;
    int status = F_NO_ERROR;
    uint32_t count;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */

    if (!prefetch && (length == 1))
    {
	status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_READY, 0);

	if (status == F_NO_ERROR)
	{
	    do
	    {
		status = stm32l0_sdspi_command(sdspi, SD_CMD_READ_SINGLE_BLOCK, (address << sdspi->shift), 1);

		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_receive(sdspi, data, DOSFS_BLK_SIZE, &count);
		    
		    if (status == F_NO_ERROR)
		    {
			if (count != DOSFS_BLK_SIZE)
			{
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
			    if (retries)
			    {
				SDSPI_STATISTICS_COUNT(sdcard_receive_retry);
				
				retries--;
				
				continue;
			    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
			    
			    SDSPI_STATISTICS_COUNT(sdcard_receive_fail);
			    
			    status = F_ERR_READ;
			}
			else
			{
			    SDSPI_STATISTICS_COUNT(sdcard_read_single);
			    
			    data += DOSFS_BLK_SIZE;
			    
			    address++;
			    length--;
			}
		    }
		}
	    }
	    while ((status == F_NO_ERROR) && length);

	    status = stm32l0_sdspi_unlock(sdspi, status);
	}
    }
    else
    {
	if (prefetch)
	{
	    status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_READ_MULTIPLE, address);
	}
	else
	{
	    status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_READY, 0);
	}

	if (status == F_NO_ERROR)
	{
	    do
	    {
		if (sdspi->state != STM32L0_SDSPI_STATE_READ_MULTIPLE)
		{
		    status = stm32l0_sdspi_command(sdspi, SD_CMD_READ_MULTIPLE_BLOCK, (address << sdspi->shift), 1);

		    if (status == F_NO_ERROR)
		    {
			sdspi->state = STM32L0_SDSPI_STATE_READ_MULTIPLE;
			sdspi->address = address;
			sdspi->count = 0;
		    }
		}

		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_receive(sdspi, data, length * DOSFS_BLK_SIZE, &count);
	    
		    if (status == F_NO_ERROR)
		    {
			count /= DOSFS_BLK_SIZE;
			
			SDSPI_STATISTICS_COUNT_N(sdcard_read_multiple, count);
			
			if (length != count)
			{
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
			    data += (DOSFS_BLK_SIZE * count);
			    
			    address += count;
			    length -= count;
			    
			    if (count)
			    {
				SDSPI_STATISTICS_COUNT(sdcard_receive_retry);
				
