GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_sdspi.c
				retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
				
				continue;
			    }
			    else
			    {
				if (retries)
				{
				    SDSPI_STATISTICS_COUNT(sdcard_receive_retry);
				    
				    retries--;
				    
				    continue;
				}
			    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
			    
			    SDSPI_STATISTICS_COUNT(sdcard_receive_fail);
			    
			    status = F_ERR_READ;
			}
			else
			{
			    sdspi->address += length;
			    sdspi->count += length;

			    length = 0;

			    if (!prefetch)
			    {
				status = stm32l0_sdspi_read_stop(sdspi);
			    }
			}
		    }
		}
	    }
	    while ((status == F_NO_ERROR) && length);
	    
	    status = stm32l0_sdspi_unlock(sdspi, status);
	}
    }

    return status;
}

static int stm32l0_sdspi_write(void *context, uint32_t address, const uint8_t *data, uint32_t length, bool wait)
{
    stm32l0_sdspi_t *sdspi = (stm32l0_sdspi_t*)context;
    int status = F_NO_ERROR;
    bool check;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */

    if (wait && (length == 1))
    {
	status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_READY, 0);

	if (status == F_NO_ERROR)
	{
	    do
	    {
		status = stm32l0_sdspi_command(sdspi, SD_CMD_WRITE_SINGLE_BLOCK, (address << sdspi->shift), 0);
	    
		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_transmit(sdspi, SD_START_WRITE_SINGLE_TOKEN, data, DOSFS_BLK_SIZE, &check);
		
		    if (status == F_NO_ERROR)
		    {
			sdspi->state = STM32L0_SDSPI_STATE_WRITE_STOP;

			if (check)
			{
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
			    if (retries)
			    {
				SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
			    
				retries--;
			    
				continue;
			    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
			
			    SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);
			
			    status = F_ERR_WRITE;
			}
			else
			{
			    SDSPI_STATISTICS_COUNT(sdcard_write_single);
			
			    address++;
			    length--;

			    status = stm32l0_sdspi_write_sync(sdspi);
			}
		    }
		}
	    }
	    while ((status == F_NO_ERROR) && length);

	    status = stm32l0_sdspi_unlock(sdspi, status);
	}
    }
    else
    {
	status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_WRITE_MULTIPLE, address);

	if (status == F_NO_ERROR)
	{
	    do
	    {
		if (sdspi->state != STM32L0_SDSPI_STATE_WRITE_MULTIPLE)
		{
		    status = stm32l0_sdspi_command(sdspi, SD_CMD_WRITE_MULTIPLE_BLOCK, (address << sdspi->shift), 0);
			
		    if (status == F_NO_ERROR)
		    {
			sdspi->state = STM32L0_SDSPI_STATE_WRITE_MULTIPLE;
			sdspi->address = address;
			sdspi->count = 0;
		    }
		}

		if (status == F_NO_ERROR)
		{
		    status = stm32l0_sdspi_transmit(sdspi, SD_START_WRITE_MULTIPLE_TOKEN, data, length * DOSFS_BLK_SIZE, &check);

		    if (status == F_NO_ERROR)
		    {
			if (check)
			{
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
			    uint32_t count, offset;
			    uint8_t temp[4];
				
			    status = stm32l0_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
				
			    if (status == F_NO_ERROR)
			    {
				status = stm32l0_sdspi_command(sdspi, SD_ACMD_SEND_NUM_WR_BLOCKS, 0, 0);

				if (status == F_NO_ERROR)
				{
				    status = stm32l0_sdspi_receive(sdspi, &temp[0], 4, &count);
				    
				    if (status == F_NO_ERROR)
				    {
					if (count == 4)
					{
					    offset = (((uint32_t)temp[0] << 24) |
						      ((uint32_t)temp[1] << 16) |
						      ((uint32_t)temp[2] <<  8) |
						      ((uint32_t)temp[3] <<  0));

					    if (offset >= sdspi->count)
					    {
						offset -= sdspi->count;

						SDSPI_STATISTICS_COUNT_N(sdcard_write_multiple, offset);
				    
						data += (offset * DOSFS_BLK_SIZE);
				    
						address += offset;
						length -= offset;

						if (offset)
						{
						    SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
						    
						    retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
						    
						    continue;
						}
						else
						{
						    if (retries)
						    {
							SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
							
							retries--;
							
							continue;
						    }
						}
					    }
					}
				    }
				}
			    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
				
			    SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);
			
			    status = F_ERR_WRITE;
			}
			else
			{
			    SDSPI_STATISTICS_COUNT_N(sdcard_write_multiple, length);

			    sdspi->address += length;
			    sdspi->count += length;

			    length = 0;

			    if (wait)
			    {
				status = stm32l0_sdspi_write_stop(sdspi);
				
				if (status == F_NO_ERROR)
				{
				    status = stm32l0_sdspi_write_sync(sdspi);
				}
			    }
			}
		    }
		}
	    }
	    while ((status == F_NO_ERROR) && length);
	
	    status = stm32l0_sdspi_unlock(sdspi, status);
	}
    }

    return status;
}

static int stm32l0_sdspi_sync(void *context)
{
    stm32l0_sdspi_t *sdspi = (stm32l0_sdspi_t*)context;
    int status = F_NO_ERROR;

    if (sdspi->state >= STM32L0_SDSPI_STATE_READ_MULTIPLE)
    {
        status = stm32l0_sdspi_lock(sdspi, STM32L0_SDSPI_STATE_READY, 0);

	if (status == F_NO_ERROR)
	{
	    status = stm32l0_sdspi_unlock(sdspi, status);
	}
    }

    return status;
}

static const dosfs_device_interface_t stm32l0_sdspi_interface = {
    stm32l0_sdspi_release,
    stm32l0_sdspi_info,
    stm32l0_sdspi_notify,
    stm32l0_sdspi_format,
    stm32l0_sdspi_erase,
    stm32l0_sdspi_discard,
    stm32l0_sdspi_read,
    stm32l0_sdspi_write,
    stm32l0_sdspi_sync,
};

int stm32l0_sdspi_initialize(stm32l0_spi_t *spi, const stm32l0_sdspi_params_t *params)
{
    stm32l0_sdspi_t *sdspi = (stm32l0_sdspi_t*)&stm32l0_sdspi;
    int status = F_NO_ERROR;

    dosfs_device.lock = DOSFS_DEVICE_LOCK_INIT;
    dosfs_device.context = (void*)sdspi;
    dosfs_device.interface = &stm32l0_sdspi_interface;

    sdspi->option = 0;

    if (sdspi->state == STM32L0_SDSPI_STATE_NONE)
    {
	if (spi->state == STM32L0_SPI_STATE_NONE)
	{
	    status = F_ERR_INITFUNC;
	}
	else
	{
	    sdspi->spi = spi;
	    sdspi->pin_cs = params->pin_cs;

	    stm32l0_spi_enable(spi); // bump up refcount

	    /* Try GO_IDLE after a reset, as the SDCARD could be still
	     * powered during the reset.
	     */
	    stm32l0_sdspi_idle(sdspi, NULL);
	    
	    sdspi->state = STM32L0_SDSPI_STATE_INIT;
	}
    }
    
    dosfs_device.lock = 0;

    return status;
}
